Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/civil_marriage_ceremony.html.txt.tmx
Source language: en
Languages: ga

source: Following the commencement of Part 6 of the Civil Registration Act 2004 on 5 November 2007, to legally marry you require a Marriage Registration Form (MRF) from a Registrar and whoever is solemnising your marriage must be on the Register of Solemnisers (pdf)
ga: Tar éis thosach Choda 6 den Acht um Chlárú Sibhialta 2004 ar an 5 Samhain 2007, chun pósadh go dleathach, tá sé de dhíth ort Foirm Chláraithe Pósta (FCP) a fháil ón gCláraitheoir, agus caithfidh duine ar bith atá ag sollúnú do phósadh a bheith ar Chlár na Sollúnóirí (pdf)

source: The Registrar issues the MRF when you give your 3 month notification to the Registrar
ga: Eisíonn an Cláraitheoir an FCP nuair a thugann tú fógra 3 mhí don Chláraitheoir

source: It is also now possible to get married by civil ceremony in the office of a Registrar of Civil Marriages or in some other venue that is approved by a Registrar
ga: Tá sé indéanta anois pósadh trí shearmanas sibhialta in Oifig Chláraitheoir na bPóstaí Sibhialta nó in ionad eile atá ceadaithe ag an gCláraitheoir

source: If you are getting married by civil ceremony in a Registry Office or other approved place, you should approach the Registrar of Civil Marriages for the district in which you intend to marry for information on how to proceed
ga: Má tá tú ag pósadh trí shearmanas sibhialta in Oifig Chláraithe nó áit cheadaithe eile, ba chóir duit teagmháil a dhéanamh le Cláraitheoir na bPóstaí Sibhialta don dúiche ina bhfuil sé beartaithe agat pósadh, chun faisnéis a fháil maidir leis an gceist a bhogadh ar aghaidh

source: There is no requirement to live in the district where you want to get married
ga: Níl chaithfidh tú bheith i do chónaí sa dúiche ina bhfuil tú ag iarraidh pósadh

source: As well as arranging your civil marriage ceremony there is also a requirement to give 3 months notification to a Registrar
ga: Chomh maith le searmanas an phósta sibhialta agat a eagrú, caithfidh tú fógra 3 mhí a thabhairt do Chláraitheoir

source: This does not have to be the same Registrar
ga: Ní gá go mbeadh an Cláraitheoir céanna i gceist

source: A civil ceremony can be held in a Registry Office or some other venue that is approved by a Registrar
ga: Is féidir searmanas sibhialta a thionól san Oifig Chláraithe nó in ionad eile atá ceadaithe ag an gCláraitheoir

source: A Registrar will also have to be available to solemnise the marriage
ga: Ní foláir nó go mbeidh Cláraitheoir ar fáil chun an pósadh a shollúnú

source: If you want to get married in a venue other than the Registry Office you should contact the Registry Office for the district the venue is located in to arrange to have it approved
ga: Más mian leat a bheith pósta in ionad lasmuigh den Oifig Chláraithe, ba chóir duit teagmháil a dhéanamh leis an Oifig Chláraithe don dúiche ina bhfuil an t-ionad lonnaithe, ionas gur féidir socruithe a dhéanamh chun an t-ionad a cheadú

source: This may involve the Registrar inspecting the venue
ga: D'fhéadfadh an Cláraitheoir an t-ionad a scrúdú sa chás seo

source: According to the legislation the place where the solemnisation takes place must be open to the public
ga: De réir na reachtaíochta, ní mór don áit a bhfuil an sollúnú ar bun a bheith oscailte don phobal

source: The Civil Registration (Amendment) Act 2014 amended the legislation to clarify that a place that is open to the public means:
ga: Leasaigh an tAcht um Chlárú Sibhialta (Leasú) 2014 an reachtaíocht go shoiléiriú ar áit atá ar oscailt don phobal. Tá sé:

source: • A building that is open to the public or
ga: • Foirgneamh atá oscailte don phobal nó

source: • A courtyard, garden, yard, field or piece of ground that is open to the public and is near to and usually enjoyed with a building that is open to the public
ga: • Clós, gairdín, clós, réimse nó píosa talún atá oscailte don phobal agus tá sé in aice le agus a theachtar de ghnáth leis an bhfoirgneamh atá ar oscailt don phobal

source: The guidelines for marriage venues are available on the General Registrar's website
ga: Tá treoirlínte na n-ionad pósta ar fáil ó láithreán gréasáin an Phríomh-Chláraitheora

source: To ensure the venue is approved in time for your wedding you should arrange for the approval well in advance of notifying the Registrar
ga: Chun cinntiú go bhfuil an t-ionad ceadaithe in am don phósadh, ba chóir duit an cead a eagrú tamall maith sula dtugann tú fógra don Chláraitheoir

source: There will be an additional fee for a civil ceremony held in a venue other than a Registry Office
ga: Gearrtar táille bhreise do shearmanas sibhialta a thionóltar in ionad lasmuigh den Oifig Chláraithe

source: If you fulfill the 3 months notification requirements and there is no impediment to you getting married, the Registrar will issue you with a Marriage Registration Form (MRF) giving you permission to marry
ga: Ma dhéanann tú na riachtanais fógartha 3 mhí a chomhlíonadh agus nach bhfuil aon bhac pósta i gceist, eiseoidh an Cláraitheoir Foirm Chláraithe Pósta (FCP) a thabharfaidh cead pósta duit

source: You should give the MRF to the Registrar who will be solemnising the marriage before the marriage ceremony
ga: Ba chóir duit FCP a thabhairt don Chláraitheoir a dhéanfaidh an pósadh a shollúnú roimh an tsearmanais phósta

source: Immediately after the marriage ceremony, the MRF should be signed by you and your spouse, the two witnesses and the Registrar
ga: Díreach tar éis an tsearmanais phósta, caithfidh FCP a beith sínithe agat féin, ag do chéile, ag an mbeirt fhinné agus ag an gCláraitheoir

source: The Registrar will register the marriage as soon as possible after the marriage
ga: Déanfaidh an Cláraitheoir an pósadh a chlárú chomh luath agus is féidir tar éis an phósta

source: The marriage ceremony is solemnised by the Registrar, who is on the Register of Solemnisers
ga: Is é an Cláraitheoir, atá ar Chlár na Sollúnóirí, a dhéanann searmanas an phósta a shollúnú

source: The ceremony must be performed in the presence of two witnesses aged 18 or over
ga: Caithfidh an searmanas tarlú i láthair beirt fhinné atá 18 bliana d'aois nó os a chionn

source: During the ceremony you and your intended spouse must make two declarations:
ga: Le linn an tsearmanais, caithfidh tú féin agus do chéile bheartaithe dhá dhearbhú a thabhairt:

source: • That you do not know of any impediment to the marriage
ga: • Nach bhfuil aon bhac pósta ar eolas agat

source: • That you accept each other as husband/wife/spouse
ga: • Go nglacann sibh a chéile mar fhear céile/bean chéile/céile

source: If either you, your intended spouse or either of the two witnesses does not have sufficient knowledge of the language in which the ceremony is being held to understand the ceremony, then the services of an interpreter must be provided
ga: Mura bhfuil dóthain tuisceana agat féin, ag an gcéile beartaithe, nó ag ceachtar den dá fhinné ar an teanga in bhfuil an searmanas á thionól, caithfear seirbhísí ateangaire a sholáthar

source: It is your responsibility to provide the services
ga: Is tusa atá freagrach as na seirbhísí a sholáthar

source: There are additional fees for civil ceremonies held in venues other than Registry Offices
ga: Níl ghearrtar aon táillí breise i leith searmanais shibialta a thionóltar in ionaid lasmuigh d'Oifigí Cláraithe

source: You should serve notice on the Registrar of Civil Marriages for the district where you intend getting married
ga: Tá fáil ar liosta Cláraitheoirí anseo

source: You can book an appointment with a Registrar online at crsappointments.ie
ga: Is féidir leat leabhar coinne a dhéanamh le Cláraitheoir ar líne ag crsappointments.ie

source: Contact details for your local Civil Registrar are also available from your Local Health Office in the Health Service Executive (HSE)
ga: Tá fáil ar shonraí teagmhála i gcomhair do Chláraitheoir áitiúil ó d'Oifig Sláinte Áitiúil i bhFeidhmeannacht na Seirbhíse Sláinte (FSS)
